[
    {
        "id": "1",
        "image": "charley_utting.png",
        "name": "Charley",
        "title": "Chair",
        "pronouns": "She/They",
        "text": "Originally from England UK, they have been calling North Leitrim home since 2013. \nCharley is Bi/Pan and is a founding member of Leitrim Pride and has worked with several other LGBTQ+ groups down the years including OutWest and Sligo Pride, she is a current Steering Group member of Full Spectrum Ireland (Ireland's first disabled LGBTQI+ peer support group). \nHer passion for promoting visibility and acceptance for the LGBTQ+ community can also be seen in their professional work, as she is the co-owner of Tully Crafts with their mother Davina, which sells a wide range of LGBTQ+ and Esoteric hand crafted items, currently stocking over 40 different LGBTQ+ flag designs. They can often be found making items for Tully Crafts of an evening."
    },
    {
        "id": "4",
        "image": "",
        "name": "Gavin",
        "title": "Public Relations (PRO)",
        "pronouns": "",
        "text": ""
    },
    {
        "id": "5",
        "image": "Isolde_OBrolchainCarmody.jpeg",
        "name": "Isolde",
        "title": "Events Chair",
        "pronouns": "She/Her",
        "text": "Isolde was born and reared in Dublin, but escaped in 1999, and has now lived in Leitrim longer than she ever did in the big schmoke. \nShe works as a wheelchair dancer with Undercurrent dance company, facilitates an online disabled writers’ group, and has fingers in many other artistic pies. Her alter-ego, Ms Honeysuckle Rose, can be spotted at Leitrim Pride events. \nHer voluntary work has always been rights-based, from co-founding Full Spectrum Ireland (peer network for disabled LGBTI+ people in Ireland), to campaigning for Marriage Equality and Together for Yes, to various Pride festivals. \nShe does most of this work from her living room, in the company of her guide-dog Ari and (currently) four cats. She runs on tea."
    },
    {
        "id": "6",
        "image": "sarah-w.jpg",
        "name": "Sarah",
        "title": "Social Media Co-ordinator",
        "pronouns": "She/Her/They",
        "text": "Sarah grew up in Leitrim from the age of seven, and moved back after college in DIT and NUIM. \nSarah’s professional background is in theatre and Dramatherapy, has given specialised trainings in Theatre of the Oppressed disciplines of Forum and Legislative Theatre -methods of using theatre to discuss and workshop solutions to social and political situations of oppression with groups living the experience with a view to social-political action and to affect law. \nAs a member of the LGBTI+ community in Leitrim and background in activism in Ireland; an advocate for peacebuilding, disability rights, mental and emotional wellbeing. Sarah is passionate about social inclusion and wants to see fun events and spaces for LGBTI+ identifiers and allies continue to emerge and grow, especially in more rural areas like Leitrim. \nKeenly interested in community cohesion, and support structures to combat isolations experienced by individuals, and families in our communities."
    },
    {
        "id": "7",
        "image": "martin_cooke.jpeg",
        "name": "Marty",
        "title": "OCM",
        "pronouns": "He/Him",
        "text": "Marty (he/him) was born in England, and has lived in Co. Leitrim since 1986. \nHaving worked in England for fifteen years teaching second level sciences, and then in Ireland in Community Development and Adult Education, Marty is now retired from paid work. \nMarty has been involved with OutWest since 2002, originally as a patron attending their social meetings, before joining their Committee in 2004. \nMarty is also on the Board of LGBT Ireland which, among other things, oversees the National LGBT Helpline. Marty was actually involved in the initial planning sessions before the launch of the Helpline in 2010."
    },
    {
        "id": "8",
        "image": "",
        "name": "Laoisa",
        "title": "OCM",
        "pronouns": "",
        "text": ""
    },
    {
        "id": "10",
        "image": "",
        "name": "Kevin",
        "title": "OCM",
        "pronouns": "",
        "text": ""
    },
    {
        "id": "11",
        "image": "",
        "name": "Patrick",
        "title": "OCM",
        "pronouns": "",
        "text": ""
    }
]